{"title": "Baptisms - 1816-1838", "creator": "Digitization  of the Archives of the Diocese of St. Augustine (DADS)", "subject": "Baptisms; Spanish Florida", "description": "Box 30 - Baptisms contains records created during the nineteenth century in Florida.  Presumably only individuals of predominantly white ancestry are recorded in these documents. These documents were originally bound in a volume entitled, \"Libro quarto de bautismos de blancos…,\" but are now only loose folios.   These records range from 13 January 1816 to 13 February 1839 and comprise pages 1-452. The Spanish entries contain considerably more information than the Latin entries.  At a minimum each Spanish entry records the date of baptism; date of the individual's birth or age at baptism; name of the individual receiving baptism; legitimacy of the individual's birth; if known, the parents' names and nationalities or places of previous residence; godparents' names and places of current residency; name and title of priest who performed the baptism.  Additional information includes: grandparents' names, nationalities or places of previous residence; military rank and/or administrative title of any male mentioned in the entry; previous religious affiliation; marital status; spouse's name; health condition at time of baptism; individual's nationality or place of previous residency.   At a minimum, each Latin entry records name given at baptism, date of baptism, names of sponsors, names of parents, and name of priest who performed the baptism.  Additional information that appears in the Latin entries includes: legitimacy of birth, and date of birth. Included is a twentieth-century, typed index, alphabetized by last name.  ", "publisher": "Slave Societies Digital Archive", "identifier": 245657, "type": "Ecclesiastical records", "format": "Loose folios, 1 index.", "language": "Latin; Spanish", "images": 459, "country": "United States", "state": "Florida", "city": "St. Augustine", "coords": "29.89472,-81.31444", "institution": "Archives of the Diocese of St Augustine", "start date": "1816", "end date": "1838"}